Revit 2026 API

# FormatOptionsGetUnitTypeId Method

---

Gets the identifier of the unit used to quantify values.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ForgeTypeId GetUnitTypeId()
```
```vb
Public Function GetUnitTypeId As ForgeTypeId
```
```cpp
public:
ForgeTypeId^ GetUnitTypeId()
```
```fsharp
member GetUnitTypeId : unit -> ForgeTypeId
```

#### Return Value

ForgeTypeId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | UseDefault is true in this FormatOptions. |

Most units, such as square feet or degrees, are formatted as decimal decimal numbers. Other units may be displayed with specialized formatting methods like "feet and fractional inches" or "degrees, minutes and seconds".

#### Reference

FormatOptions Class

Autodesk.Revit.DB Namespace